- try catch

In [2]:
numerator = 10
denominator = 0

result = numerator/denominator

#하고 싶은 것은 결과 확인 출력을 꼭 하고 싶음, 어떤 일이 있어도
print('결과 확인')
## 이럴때 try catch를 쓴다

ZeroDivisionError: division by zero

In [7]:
try:
    numerator = 10
    denominator = int(input("숫자 입려간"))
    result = numerator/denominator
except ZeroDivisionError:
    print("error")
else:
    print("결과확인 : ", result)
finally:
    print("결과 확인")

숫자 입력란 123

결과확인 :  0.08130081300813008
결과 확인

## STEP 1. Connect to Server

In [10]:
import os
from mysql import connector

PASSWORD = '1234'

## 기초문법 중급 레벨 (with vs python  decorator)

try:
    with connector.connect(
        host = 'localhost',
        user = 'root',
        password = PASSWORD
    ) as database:
        print(f"Database 객체 : {database}")
except connector.Error as e:
    print(e)

Database 객체 : <mysql.connector.connection_cext.CMySQLConnection object at 0x0000017E991C5790>

## Step 2. Creating DB

In [14]:
try:
    with connector.connect(
        host = 'localhost', 
        user = 'root', 
        password = PASSWORD
    ) as database:
        print(f"Database 객체 : {database}")
        ## cursor = 커서 이게 뭘까
        with database.cursor() as cursor:
            # 쿼리문 작성
            create_db = "CREATE DATABASE book_ratings;"
            cursor.execute(create_db)

            # 생성된 DB 확인 쿼리문 쓰기
            show_existing_db = "SHOW DATABASES;"
            cursor.execute(show_existing_db)
            for db in cursor:
                print(db)

except connector.Error as e:
    print(e)

Database 객체 : <mysql.connector.connection_cext.CMySQLConnection object at 0x0000017E98C7FE50>
('book_ratings',)
('classicmodels',)
('information_schema',)
('instacart',)
('mydata',)
('mydata2',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('testdb',)
('titanic',)
('world',)

In [18]:
try:
    with connector.connect(
        host = 'localhost',
        user = 'root',
        password = PASSWORD,
        database = "book_ratings" #이것이 기존 코드와의 차이점
    ) as database:
        print(f"Database 객체 : {database}")
except connector.Error as e:
    print(e)

Database 객체 : <mysql.connector.connection_cext.CMySQLConnection object at 0x0000017E99368C10>

## Step 3: Creating Table

In [19]:
create_books_table = """
    CREATE TABLE books(
        id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
        title VARCHAR(100),
        author VARCHAR(100),
        genre VARCHAR(100),
        release_year YEAR(4)
    );
"""

try:
    with connector.connect(
        host = 'localhost',
        user = 'root',
        password = PASSWORD,
        database = "book_ratings" #이것이 기존 코드와의 차이점
    ) as database:
        print(f"Database 객체 : {database}")


        # cursor object 접근후 , 위 쿼리를 실행
        with database.cursor() as cursor:
            cursor.execute(create_books_table)
            database.commit()

            # 테이블 확인 DESCRIBE
            describe_books = "DESCRIBE books;"
            cursor.execute(describe_books)
            book_schema = cursor.fetchall()
            for column in book_schema:
                print(column)
except connector.Error as e:
    print(e)

Database 객체 : <mysql.connector.connection_cext.CMySQLConnection object at 0x0000017E98C6EDD0>
('id', 'int', 'NO', 'PRI', None, 'auto_increment')
('title', 'varchar(100)', 'YES', '', None, '')
('author', 'varchar(100)', 'YES', '', None, '')
('genre', 'varchar(100)', 'YES', '', None, '')
('release_year', 'year', 'YES', '', None, '')

## Step 4. Data Insertion
- 하나의 레코드 추가할 떄와 다중 레코드 추가할 때 사용하는 method가 다름

- 파이썬 ==> MySQL 레코드추가
- MYSQL Workbench에서 확인

In [23]:
## INSERT INTO 테이블명(컬럼명1, 컬럼명2, 컬럼명3...) Values (%s, %s,...)

insert_single_record = "INSERT INTO books (id, title, author, genre, release_year)\
    VALUES (%s, %s, %s, %s, %s)"
single_record = (
    "1", "Choose Yourself! Be Happy, Make Millions, Live the Dream", "James Altucher", "self-help", "2013"
    )

try:
    with connector.connect(
        host = 'localhost',
        user = 'root',
        password = PASSWORD,
        database = "book_ratings" 
    ) as database:
        print(f"Database 객체 : {database}")


        #커서 생성 후, 쿼리실행
        with database.cursor() as cursor:
            cursor.execute(insert_single_record, single_record)
            database.commit()
except connector.Error as e:
    print(e)

Database 객체 : <mysql.connector.connection_cext.CMySQLConnection object at 0x0000017E98C6F250>

- 다중 레코드를 추가하자

In [24]:
insert_multiple_records = "INSERT INTO books (id, title, author, genre, release_year)\
    VALUES (%s, %s, %s, %s, %s)"
multiple_records = [
    (
        "2", 
        "Skip the Line: The 10,000 Experiments Rule and Other Surprising Advice for Reaching Your Goals",
        "James Altucher",
        "self-help",
        "2021"        
    ),
    (
        "3",
        "The Power of No: Because One Little Word Can Bring Health, Abundance, and Happiness",
        "James Altucher",
        "self-help",
        "2014"
    ),
    (
        "4",
        "The 48 Laws of Power",
        "Robert Greene",
        "self-help",
        "1998"
    ),
    (
        "5",
        "Mastery",
        "Robert Greene",
        "self-help",
        "2012"
    ),
    (
        "6",
        "The Art of Seduction",
        "Robert Greene",
        "self-help",
        "2001"
    ),
]

In [25]:
try:
    with connector.connect(
        host = 'localhost',
        user = 'root',
        password = PASSWORD,
        database = "book_ratings" 
    ) as database:
        print(f"Database 객체 : {database}")


        #커서 생성 후, 쿼리실행
        with database.cursor() as cursor:
            # cursor.execute(insert_single_record, single_record)
            cursor.executemany(insert_multiple_records, multiple_records)
            database.commit()
except connector.Error as e:
    print(e)

Database 객체 : <mysql.connector.connection_cext.CMySQLConnection object at 0x0000017E99C76910>

## Step 5. Selecting Data

In [27]:
try:
    with connector.connect(
        host = 'localhost',
        user = 'root',
        password = PASSWORD,
        database = "book_ratings" 
    ) as database:
        print(f"Database 객체 : {database}")


        #커서 생성 후, 쿼리실행
        with database.cursor() as cursor:
            #쿼리문 작성
            select_cols = "SELECT author, release_year FROM books;"
            cursor.execute(select_cols)

            #데이터 확인
            df = cursor.fetchall()
            for result in df:
                print(result)
                
except connector.Error as e:
    print(e)

Database 객체 : <mysql.connector.connection_cext.CMySQLConnection object at 0x0000017E9A145510>
('James Altucher', 2013)
('James Altucher', 2021)
('James Altucher', 2014)
('Robert Greene', 1998)
('Robert Greene', 2012)
('Robert Greene', 2001)

# SELECT 사용자 정의 함수 만들기
- 어떤 테이블을 조회해도 깔끔하게 데이터 프레임으로 만드는 함수를 만드시고, 테스트를 진행해 주세요

In [31]:
import pandas as pd

def sql_to_df(table, DB):
    try:
        with connector.connect(
            host = 'localhost',
            user = 'root',
            password = '1234',
            database = f"{DB}" 
        ) as database:
            print(f"Database 객체 : {database}")
    
            with database.cursor() as cursor:
                #쿼리문 작성
                select_cols = f"SELECT * FROM {table};"
                cursor.execute(select_cols)
    
                #데이터 확인
                rows = cursor.fetchall()
                columns = [column[0] for column in cursor.description]
                df = pd.DataFrame(rows, columns=columns)
                display(df)

                    
    except connector.Error as e:
        print(e)

sql_to_df('books', 'book_ratings')
sql_to_df('customers', 'classicmodels')

Database 객체 : <mysql.connector.connection_cext.CMySQLConnection object at 0x0000017E99CA6710>

,id,title,author,genre,release_year
0,1,"Choose Yourself! Be Happy, Make Millions, Live...",James Altucher,self-help,2013
1,2,"Skip the Line: The 10,000 Experiments Rule and...",James Altucher,self-help,2021
2,3,The Power of No: Because One Little Word Can B...,James Altucher,self-help,2014
3,4,The 48 Laws of Power,Robert Greene,self-help,1998
4,5,Mastery,Robert Greene,self-help,2012
5,6,The Art of Seduction,Robert Greene,self-help,2001

Database 객체 : <mysql.connector.connection_cext.CMySQLConnection object at 0x0000017E99CC7F10>

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370.0,21000.00
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,None,Las Vegas,NV,83030,USA,1166.0,71800.00
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611.0,117300.00
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",None,Nantes,None,44000,France,1370.0,118200.00
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,None,Stavern,None,4110,Norway,1504.0,81700.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,486,Motor Mint Distributors Inc.,Salazar,Rosa,2155559857,11328 Douglas Av.,None,Philadelphia,PA,71270,USA,1323.0,72600.00
118,487,Signal Collectibles Ltd.,Taylor,Sue,4155554312,2793 Furth Circle,None,Brisbane,CA,94217,USA,1165.0,60300.00
119,489,"Double Decker Gift Stores, Ltd",Smith,Thomas,(171) 555-7555,120 Hanover Sq.,None,London,None,WA1 1DP,UK,1501.0,43300.00
120,495,Diecast Collectables,Franco,Valarie,6175552555,6251 Ingle Ln.,None,Boston,MA,51003,USA,1188.0,85100.00
121,496,Kelly's Gift Shop,Snowden,Tony,+64 9 5555500,Arenales 1938 3'A',None,Auckland,None,None,New Zealand,1612.0,110000.00

## Step 6. Update and Delete

In [32]:
update_query = """
    UPDATE 
        books
    SET 
        author = 'Big J'
    WHERE 
        author = 'James Altucher'
"""

In [35]:
try:
    with connector.connect(
        host = 'localhost', 
        user = 'root', 
        password = PASSWORD, 
        database = "book_ratings" # 이것이 기존 코드와의 차이점
    ) as database:
        print(f"Database 객체 : {database}")

        # 커서 생성 후, 쿼리 실행
        with database.cursor() as cursor:
            cursor.execute(update_query)
            database.commit()

            check_query = "SELECT DISTINCT author FROM books;"
            cursor.execute(check_query)

            for result in cursor.fetchall():
                print(result)
            
except connector.Error as e:
    print(e)

Database 객체 : <mysql.connector.connection_cext.CMySQLConnection object at 0x0000017EC118BAD0>
('Big J',)
('Robert Greene',)

## Step 7. Set Records

In [36]:
try:
    with connector.connect(
        host = 'localhost', 
        user = 'root', 
        password = PASSWORD, 
        database = "book_ratings" # 이것이 기존 코드와의 차이점
    ) as database:
        print(f"Database 객체 : {database}")

        # 커서 생성 후, 쿼리 실행
        with database.cursor() as cursor:

            delete_query = "DELETE FROM books WHERE release_year <= 2010;"
            cursor.execute(delete_query)
            database.commit()
            
            check_query = "SELECT DISTINCT release_year FROM books;"
            cursor.execute(check_query)
            
            for result in cursor.fetchall():
                print(result)
            
except connector.Error as e:
    print(e)

Database 객체 : <mysql.connector.connection_cext.CMySQLConnection object at 0x0000017EC1188A10>
(2013,)
(2021,)
(2014,)
(2012,)